In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("../data/HR_RAW_DATA.csv",index_col=0)
df

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,...,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",...,20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",...,33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0",...,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN,...,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,NaN,...,19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,36,Yes,travel_rarely,"530,0$",NaN,3,1,Life Sciences,1,"967,0",...,16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,45,No,non-travel,"805,0$",NaN,4,2,NaN,1,"972,0",...,9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,39,No,travel_rarely,"903,0$",NaN,-13,5,NaN,1,NaN,...,8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,36,No,non-travel,"1229,0$",NaN,8,4,Technical Degree,1,"990,0",...,7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,46,No,NaN,"566,0$",NaN,7,2,Medical,1,NaN,...,8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

pd.set_option('display.max_columns', None)pd.set_option('display.max_rows', None)

In [4]:
pd.set_option('display.max_columns', None)
#pd.set_option('display.max_rows', None)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1614 entries, 0 to 1613
Data columns (total 41 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       1614 non-null   object
 1   Attrition                 1614 non-null   object
 2   BusinessTravel            842 non-null    object
 3   DailyRate                 1614 non-null   object
 4   Department                302 non-null    object
 5   DistanceFromHome          1614 non-null   int64
 6   Education                 1614 non-null   int64
 7   EducationField            869 non-null    object
 8   employeecount             1614 non-null   int64
 9   employeenumber            1183 non-null   object
 10  EnvironmentSatisfaction   1614 non-null   int64
 11  Gender                    1614 non-null   int64
 12  HourlyRate                1614 non-null   object
 13  JobInvolvement            1614 non-null   int64
 14  JobLevel                  1614 non-null   int64
 15  JobRole                   1614 non-null   object
 16  JobSatisfaction           1614 non-null   int64
 17  MaritalStatus             963 non-null    object
 18  MonthlyIncome             771 non-null    object
 19  MonthlyRate               1614 non-null   int64
 20  NUMCOMPANIESWORKED        1614 non-null   int64
 21  Over18                    713 non-null    object
 22  OverTime                  938 non-null    object
 23  PercentSalaryHike         1614 non-null   int64
 24  PerformanceRating         1419 non-null   object
 25  RelationshipSatisfaction  1614 non-null   int64
 26  StandardHours             419 non-null    object
 27  StockOptionLevel          1614 non-null   int64
 28  TOTALWORKINGYEARS         1088 non-null   object
 29  TrainingTimesLastYear     1614 non-null   int64
 30  WORKLIFEBALANCE           1506 non-null   object
 31  YearsAtCompany            1614 non-null   int64
 32  YearsInCurrentRole        34 non-null     object
 33  YearsSinceLastPromotion   1614 non-null   int64
 34  YEARSWITHCURRMANAGER      1614 non-null   int64
 35  SameAsMonthlyIncome       771 non-null    object
 36  DateBirth                 1614 non-null   int64
 37  Salary                    1614 non-null   object
 38  RoleDepartament           302 non-null    object
 39  NUMBERCHILDREN            0 non-null      float64
 40  RemoteWork                1614 non-null   object
dtypes: float64(1), int64(18), object(22)
memory usage: 529.6+ KB

In [6]:
df.head(10)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0",3,0,58,3,5,ManaGER,4,Married,"19232,0",4933,1,NaN,No,11,"3,0",4,NaN,0,"22,0",3,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN,1,1,82,3,4,ReseArCH DIrECtOr,3,Married,"17169,0",26703,3,Y,NaN,19,"3,0",2,NaN,2,NaN,2,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,NaN,1,1,45,4,4,sAleS EXECUtIve,1,Divorced,NaN,7739,2,Y,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
5,48,No,NaN,"117,0$",Research & Development,22,3,Medical,1,"1900,0",4,1,58,3,4,MANAger,4,NaN,"17174,0",2437,3,NaN,No,11,"3,0",2,NaN,1,NaN,3,"3,0",22,NaN,4,7,"17174,0",1975,1000000000$,MANAger - Research & Development,NaN,Yes
6,59,No,NaN,"1435,0$",NaN,25,3,Life Sciences,1,"81,0",1,1,99,3,3,Sales ExeCutIVe,1,NaN,NaN,2354,7,Y,NaN,11,"3,0",4,NaN,0,"28,0",3,"2,0",21,NaN,7,9,NaN,1964,1000000000$,NaN,NaN,True
7,42,No,travel_rarely,"635,0$",NaN,1,1,NaN,1,"387,0",2,0,99,3,2,Sales eXEcUTiVe,3,Married,NaN,24532,1,NaN,No,25,"4,0",3,NaN,0,"20,0",3,"3,0",20,NaN,11,6,NaN,1981,1000000000$,NaN,NaN,0
8,41,No,NaN,"1276,0$",NaN,2,5,NaN,1,NaN,2,1,91,3,4,mANAGEr,1,Married,"16595,0",5626,7,NaN,No,16,"3,0",2,NaN,1,"22,0",2,"3,0",18,NaN,11,8,"16595,0",1982,1000000000$,NaN,NaN,True
9,41,No,travel_frequently,"840,0$",NaN,9,3,NaN,1,"999,0",1,0,64,3,5,reSEaRCH DIrectoR,3,NaN,NaN,3735,2,NaN,No,17,"3,0",2,NaN,1,"21,0",2,"4,0",18,NaN,0,11,NaN,1982,1000000000$,NaN,NaN,0

In [7]:
df.describe ().T

,count,mean,std,min,25%,50%,75%,max
DistanceFromHome,1614.0,4.527261,14.591913,-49.0,2.0,5.0,11.0,29.0
Education,1614.0,2.925031,1.022357,1.0,2.0,3.0,4.0,5.0
employeecount,1614.0,1.000000,0.000000,1.0,1.0,1.0,1.0,1.0
EnvironmentSatisfaction,1614.0,4.294919,6.993559,1.0,2.0,3.0,4.0,49.0
Gender,1614.0,0.398389,0.489718,0.0,0.0,0.0,1.0,1.0
JobInvolvement,1614.0,2.739777,0.711567,1.0,2.0,3.0,3.0,4.0
JobLevel,1614.0,2.068154,1.101344,1.0,1.0,2.0,3.0,5.0
JobSatisfaction,1614.0,2.738538,1.106163,1.0,2.0,3.0,4.0,4.0
MonthlyRate,1614.0,14284.495663,7110.414585,2094.0,8001.0,14248.5,20364.0,26999.0
NUMCOMPANIESWORKED,1614.0,2.673482,2.506152,0.0,1.0,2.0,4.0,9.0
PercentSalaryHike,1614.0,15.165428,3.648610,11.0,12.0,14.0,18.0,25.0
RelationshipSatisfaction,1614.0,2.704461,1.079031,1.0,2.0,3.0,4.0,4.0
StockOptionLevel,1614.0,0.791202,0.842396,0.0,0.0,1.0,1.0,3.0
TrainingTimesLastYear,1614.0,2.809789,1.297765,0.0,2.0,3.0,3.0,6.0
YearsAtCompany,1614.0,7.132590,6.124237,0.0,3.0,5.0,9.0,40.0
YearsSinceLastPromotion,1614.0,2.245973,3.235665,0.0,0.0,1.0,3.0,15.0
YEARSWITHCURRMANAGER,1614.0,4.220570,3.562695,0.0,2.0,3.0,7.0,17.0
DateBirth,1614.0,1986.076208,9.101332,1963.0,1980.0,1987.0,1993.0,2005.0
NUMBERCHILDREN,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [8]:
df.describe (include="object").T   #

                    count unique                       top  freq
Age                  1614     54                        35    84
Attrition            1614      2                        No  1355
BusinessTravel        842      3             travel_rarely   586
DailyRate            1614    849                      nan$   124
Department            302      3   Research & Development    196
EducationField        869      6             Life Sciences   349
employeenumber       1183   1079                     482,0     2
HourlyRate           1614     72             Not Available    84
JobRole              1614   1579                  mANager      4
MaritalStatus         963      5                   Married   404
MonthlyIncome         771    668                    6347,0     4
Over18                713      1                         Y   713
OverTime              938      2                        No   682
PerformanceRating    1419      2                       3,0  1205
StandardHours         419      1                      80,0   419
TOTALWORKINGYEARS    1088     40                      10,0   144
WORKLIFEBALANCE      1506      4                       3,0   913
YearsInCurrentRole     34     10                       2,0    11
SameAsMonthlyIncome   771    668                    6347,0     4
Salary               1614      1               1000000000$  1614
RoleDepartament       302    301        MaNAgeR  -  Sales      2
RemoteWork           1614      5                         1   360

In [9]:
df.duplicated().sum()

0

In [10]:
df["Age"].value_counts() ##Hay valores no numÃ©ricos como fifty-eight. Hacer un replace de estos y cambiarlos a nÃºmeros.

35              84
34              83
31              82
29              78
36              74
32              64
38              64
30              63
33              61
40              60
27              54
37              53
28              53
42              50
45              48
41              46
26              45
39              45
43              40
46              38
44              34
50              31
25              27
24              26
47              26
49              25
55              24
54              20
51              20
53              20
48              20
52              18
56              17
21              16
22              16
23              15
58              14
20              11
59              10
19               9
18               8
60               5
57               5
thirty-two       2
fifty-eight      1
twenty-six       1
thirty-seven     1
thirty-one       1
thirty           1
fifty-two        1
fifty-five       1
thirty-six       1
forty-seven      1
twenty-four      1
Name: Age, dtype: int64

In [11]:
df['Age'] = df['Age'].replace(['fifty_five'], '55') 
df['Age'].value_counts()

35              84
34              83
31              82
29              78
36              74
32              64
38              64
30              63
33              61
40              60
27              54
37              53
28              53
42              50
45              48
41              46
26              45
39              45
43              40
46              38
44              34
50              31
25              27
24              26
47              26
49              25
55              24
54              20
51              20
53              20
48              20
52              18
56              17
21              16
22              16
23              15
58              14
20              11
59              10
19               9
18               8
60               5
57               5
thirty-two       2
fifty-eight      1
twenty-six       1
thirty-seven     1
thirty-one       1
thirty           1
fifty-two        1
fifty-five       1
thirty-six       1
forty-seven      1
twenty-four      1
Name: Age, dtype: int64

In [12]:
nuevas_columnas = {columna: columna.lower()for columna in df.columns}

df.rename (columns=nuevas_columnas, inplace= True)

df.columns

Index(['age', 'attrition', 'businesstravel', 'dailyrate', 'department',
       'distancefromhome', 'education', 'educationfield', 'employeecount',
       'employeenumber', 'environmentsatisfaction', 'gender', 'hourlyrate',
       'jobinvolvement', 'joblevel', 'jobrole', 'jobsatisfaction',
       'maritalstatus', 'monthlyincome', 'monthlyrate', 'numcompaniesworked',
       'over18', 'overtime', 'percentsalaryhike', 'performancerating',
       'relationshipsatisfaction', 'standardhours', 'stockoptionlevel',
       'totalworkingyears', 'trainingtimeslastyear', 'worklifebalance',
       'yearsatcompany', 'yearsincurrentrole', 'yearssincelastpromotion',
       'yearswithcurrmanager', 'sameasmonthlyincome', 'datebirth', 'salary',
       'roledepartament', 'numberchildren', 'remotework'],
      dtype='object')

In [13]:
# Crear un diccionario con el cambio de edades a valores numÃ©ricos
edades_cambio =  {'fifty-five': '55', 'thirty-six': '36', 'forty-seven': '47', 'twenty-four': '24', 'thirty-seven': '37', 'fifty-two': '52', 'fifty-eight': '58', 'twenty-six': '26', 'thirty-one': '31', 'thirty': '30', 'thirty-two': '32'} 


# Reemplazar las edades en la columna "Age" utilizando el diccionario
df['age'] = df['age'].replace(edades_cambio)

# Contar las ocurrencias de cada edad en la columna "Age"
conteo_edades = df['age'].value_counts()

# Imprimir el resultado
print(conteo_edades)

35    84
31    83
34    83
29    78
36    75
32    66
38    64
30    64
33    61
40    60
27    54
37    54
28    53
42    50
45    48
41    46
26    46
39    45
43    40
46    38
44    34
50    31
24    27
47    27
25    27
55    25
49    25
54    20
51    20
53    20
48    20
52    19
56    17
22    16
21    16
58    15
23    15
20    11
59    10
19     9
18     8
60     5
57     5
Name: age, dtype: int64

In [14]:
df['age']=df['age'].apply(pd.to_numeric)

In [15]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
age,1614.0,36.920694,9.102157,18.0,30.0,36.0,43.0,60.0
distancefromhome,1614.0,4.527261,14.591913,-49.0,2.0,5.0,11.0,29.0
education,1614.0,2.925031,1.022357,1.0,2.0,3.0,4.0,5.0
employeecount,1614.0,1.000000,0.000000,1.0,1.0,1.0,1.0,1.0
environmentsatisfaction,1614.0,4.294919,6.993559,1.0,2.0,3.0,4.0,49.0
gender,1614.0,0.398389,0.489718,0.0,0.0,0.0,1.0,1.0
jobinvolvement,1614.0,2.739777,0.711567,1.0,2.0,3.0,3.0,4.0
joblevel,1614.0,2.068154,1.101344,1.0,1.0,2.0,3.0,5.0
jobsatisfaction,1614.0,2.738538,1.106163,1.0,2.0,3.0,4.0,4.0
monthlyrate,1614.0,14284.495663,7110.414585,2094.0,8001.0,14248.5,20364.0,26999.0
numcompaniesworked,1614.0,2.673482,2.506152,0.0,1.0,2.0,4.0,9.0
percentsalaryhike,1614.0,15.165428,3.648610,11.0,12.0,14.0,18.0,25.0
relationshipsatisfaction,1614.0,2.704461,1.079031,1.0,2.0,3.0,4.0,4.0
stockoptionlevel,1614.0,0.791202,0.842396,0.0,0.0,1.0,1.0,3.0
trainingtimeslastyear,1614.0,2.809789,1.297765,0.0,2.0,3.0,3.0,6.0
yearsatcompany,1614.0,7.132590,6.124237,0.0,3.0,5.0,9.0,40.0
yearssincelastpromotion,1614.0,2.245973,3.235665,0.0,0.0,1.0,3.0,15.0
yearswithcurrmanager,1614.0,4.220570,3.562695,0.0,2.0,3.0,7.0,17.0
datebirth,1614.0,1986.076208,9.101332,1963.0,1980.0,1987.0,1993.0,2005.0
numberchildren,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1614 entries, 0 to 1613
Data columns (total 41 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       1614 non-null   int64
 1   attrition                 1614 non-null   object
 2   businesstravel            842 non-null    object
 3   dailyrate                 1614 non-null   object
 4   department                302 non-null    object
 5   distancefromhome          1614 non-null   int64
 6   education                 1614 non-null   int64
 7   educationfield            869 non-null    object
 8   employeecount             1614 non-null   int64
 9   employeenumber            1183 non-null   object
 10  environmentsatisfaction   1614 non-null   int64
 11  gender                    1614 non-null   int64
 12  hourlyrate                1614 non-null   object
 13  jobinvolvement            1614 non-null   int64
 14  joblevel                  1614 non-null   int64
 15  jobrole                   1614 non-null   object
 16  jobsatisfaction           1614 non-null   int64
 17  maritalstatus             963 non-null    object
 18  monthlyincome             771 non-null    object
 19  monthlyrate               1614 non-null   int64
 20  numcompaniesworked        1614 non-null   int64
 21  over18                    713 non-null    object
 22  overtime                  938 non-null    object
 23  percentsalaryhike         1614 non-null   int64
 24  performancerating         1419 non-null   object
 25  relationshipsatisfaction  1614 non-null   int64
 26  standardhours             419 non-null    object
 27  stockoptionlevel          1614 non-null   int64
 28  totalworkingyears         1088 non-null   object
 29  trainingtimeslastyear     1614 non-null   int64
 30  worklifebalance           1506 non-null   object
 31  yearsatcompany            1614 non-null   int64
 32  yearsincurrentrole        34 non-null     object
 33  yearssincelastpromotion   1614 non-null   int64
 34  yearswithcurrmanager      1614 non-null   int64
 35  sameasmonthlyincome       771 non-null    object
 36  datebirth                 1614 non-null   int64
 37  salary                    1614 non-null   object
 38  roledepartament           302 non-null    object
 39  numberchildren            0 non-null      float64
 40  remotework                1614 non-null   object
dtypes: float64(1), int64(19), object(21)
memory usage: 529.6+ KB

In [17]:
df['attrition'].value_counts()

No     1355
Yes     259
Name: attrition, dtype: int64

In [18]:
df['businesstravel'].value_counts()

travel_rarely        586
travel_frequently    165
non-travel            91
Name: businesstravel, dtype: int64

In [19]:
df['businesstravel']=df['businesstravel'].str.replace("-","_")

In [20]:
df['businesstravel']=df['businesstravel'].replace(np.nan, "desconocido")

df['businesstravel']

0         desconocido
1         desconocido
2       travel_rarely
3       travel_rarely
4         desconocido
            ...
1609    travel_rarely
1610       non_travel
1611    travel_rarely
1612       non_travel
1613      desconocido
Name: businesstravel, Length: 1614, dtype: object

In [21]:
df.rename(columns={"businesstravel": "business_travel"}, inplace=True)

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1614 entries, 0 to 1613
Data columns (total 41 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       1614 non-null   int64
 1   attrition                 1614 non-null   object
 2   business_travel           1614 non-null   object
 3   dailyrate                 1614 non-null   object
 4   department                302 non-null    object
 5   distancefromhome          1614 non-null   int64
 6   education                 1614 non-null   int64
 7   educationfield            869 non-null    object
 8   employeecount             1614 non-null   int64
 9   employeenumber            1183 non-null   object
 10  environmentsatisfaction   1614 non-null   int64
 11  gender                    1614 non-null   int64
 12  hourlyrate                1614 non-null   object
 13  jobinvolvement            1614 non-null   int64
 14  joblevel                  1614 non-null   int64
 15  jobrole                   1614 non-null   object
 16  jobsatisfaction           1614 non-null   int64
 17  maritalstatus             963 non-null    object
 18  monthlyincome             771 non-null    object
 19  monthlyrate               1614 non-null   int64
 20  numcompaniesworked        1614 non-null   int64
 21  over18                    713 non-null    object
 22  overtime                  938 non-null    object
 23  percentsalaryhike         1614 non-null   int64
 24  performancerating         1419 non-null   object
 25  relationshipsatisfaction  1614 non-null   int64
 26  standardhours             419 non-null    object
 27  stockoptionlevel          1614 non-null   int64
 28  totalworkingyears         1088 non-null   object
 29  trainingtimeslastyear     1614 non-null   int64
 30  worklifebalance           1506 non-null   object
 31  yearsatcompany            1614 non-null   int64
 32  yearsincurrentrole        34 non-null     object
 33  yearssincelastpromotion   1614 non-null   int64
 34  yearswithcurrmanager      1614 non-null   int64
 35  sameasmonthlyincome       771 non-null    object
 36  datebirth                 1614 non-null   int64
 37  salary                    1614 non-null   object
 38  roledepartament           302 non-null    object
 39  numberchildren            0 non-null      float64
 40  remotework                1614 non-null   object
dtypes: float64(1), int64(19), object(21)
memory usage: 529.6+ KB

In [23]:
df['dailyrate'].value_counts()

nan$      124
691,0$      7
329,0$      7
147,0$      6
530,0$      6
         ...
317,0$      1
891,0$      1
759,0$      1
483,0$      1
105,0$      1
Name: dailyrate, Length: 849, dtype: int64

In [24]:
df.rename(columns={"dailyrate": "daily_rate"}, inplace=True)
df

,age,attrition,business_travel,daily_rate,department,distancefromhome,education,educationfield,employeecount,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,over18,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,numberchildren,remotework
0,51,No,desconocido,"684,0$",NaN,6,3,NaN,1,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,desconocido,"699,0$",NaN,1,4,Life Sciences,1,"259,0",3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0",3,0,58,3,5,ManaGER,4,Married,"19232,0",4933,1,NaN,No,11,"3,0",4,NaN,0,"22,0",3,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN,1,1,82,3,4,ReseArCH DIrECtOr,3,Married,"17169,0",26703,3,Y,NaN,19,"3,0",2,NaN,2,NaN,2,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,46,No,desconocido,"1319,0$",NaN,3,3,Technical Degree,1,NaN,1,1,45,4,4,sAleS EXECUtIve,1,Divorced,NaN,7739,2,Y,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,36,Yes,travel_rarely,"530,0$",NaN,3,1,Life Sciences,1,"967,0",3,0,51,2,3,saLEs ExeCUTiVe,4,Married,"10325,0",5518,1,Y,NaN,11,NaN,1,NaN,1,NaN,6,"3,0",16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,45,No,non_travel,"805,0$",NaN,4,2,NaN,1,"972,0",3,0,57,3,2,LAboRaTOry tECHNiCIAn,2,NaN,"4447,0",23163,1,NaN,NaN,12,"3,0",2,NaN,0,NaN,5,"2,0",9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,39,No,travel_rarely,"903,0$",NaN,-13,5,NaN,1,NaN,13,0,41,4,3,sAlES ExECUTivE,3,Single,NaN,2560,0,NaN,No,18,"3,0",4,NaN,0,"9,0",3,"3,0",8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,36,No,non_travel,"1229,0$",NaN,8,4,Technical Degree,1,"990,0",1,0,84,3,2,SaLes ExecUtIVe,4,Divorced,NaN,25952,4,NaN,No,13,NaN,4,NaN,2,"12,0",3,"3,0",7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,46,No,desconocido,"566,0$",NaN,7,2,Medical,1,NaN,4,0,75,3,3,mAnUfactURInG DiRECTOr,3,NaN,"10845,0",24208,6,Y,NaN,13,"3,0",2,NaN,1,NaN,3,"3,0",8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

In [25]:
df['daily_rate']=df['daily_rate'].str.replace ("$", "").str.replace (",", ".")
df['daily_rate']

/tmp/ipykernel_1959/1433077915.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['daily_rate']=df['daily_rate'].str.replace ("$", "").str.replace (",", ".")

0        684.0
1        699.0
2        532.0
3        359.0
4       1319.0
         ...
1609     530.0
1610     805.0
1611     903.0
1612    1229.0
1613     566.0
Name: daily_rate, Length: 1614, dtype: object

In [26]:
df['daily_rate'].isnull().sum()

0

In [27]:
df['daily_rate']=df['daily_rate'].replace ("nan", np.nan)
df['daily_rate']

0        684.0
1        699.0
2        532.0
3        359.0
4       1319.0
         ...
1609     530.0
1610     805.0
1611     903.0
1612    1229.0
1613     566.0
Name: daily_rate, Length: 1614, dtype: object

In [28]:
df['daily_rate'].isnull().sum()

124

In [29]:
df['daily_rate']=df['daily_rate'].apply(pd.to_numeric)
df['daily_rate']

0        684.0
1        699.0
2        532.0
3        359.0
4       1319.0
         ...
1609     530.0
1610     805.0
1611     903.0
1612    1229.0
1613     566.0
Name: daily_rate, Length: 1614, dtype: float64

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1614 entries, 0 to 1613
Data columns (total 41 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       1614 non-null   int64
 1   attrition                 1614 non-null   object
 2   business_travel           1614 non-null   object
 3   daily_rate                1490 non-null   float64
 4   department                302 non-null    object
 5   distancefromhome          1614 non-null   int64
 6   education                 1614 non-null   int64
 7   educationfield            869 non-null    object
 8   employeecount             1614 non-null   int64
 9   employeenumber            1183 non-null   object
 10  environmentsatisfaction   1614 non-null   int64
 11  gender                    1614 non-null   int64
 12  hourlyrate                1614 non-null   object
 13  jobinvolvement            1614 non-null   int64
 14  joblevel                  1614 non-null   int64
 15  jobrole                   1614 non-null   object
 16  jobsatisfaction           1614 non-null   int64
 17  maritalstatus             963 non-null    object
 18  monthlyincome             771 non-null    object
 19  monthlyrate               1614 non-null   int64
 20  numcompaniesworked        1614 non-null   int64
 21  over18                    713 non-null    object
 22  overtime                  938 non-null    object
 23  percentsalaryhike         1614 non-null   int64
 24  performancerating         1419 non-null   object
 25  relationshipsatisfaction  1614 non-null   int64
 26  standardhours             419 non-null    object
 27  stockoptionlevel          1614 non-null   int64
 28  totalworkingyears         1088 non-null   object
 29  trainingtimeslastyear     1614 non-null   int64
 30  worklifebalance           1506 non-null   object
 31  yearsatcompany            1614 non-null   int64
 32  yearsincurrentrole        34 non-null     object
 33  yearssincelastpromotion   1614 non-null   int64
 34  yearswithcurrmanager      1614 non-null   int64
 35  sameasmonthlyincome       771 non-null    object
 36  datebirth                 1614 non-null   int64
 37  salary                    1614 non-null   object
 38  roledepartament           302 non-null    object
 39  numberchildren            0 non-null      float64
 40  remotework                1614 non-null   object
dtypes: float64(2), int64(19), object(20)
memory usage: 529.6+ KB

In [31]:
df['department'].value_counts()

 Research & Development     196
 Sales                       91
 Human Resources             15
Name: department, dtype: int64

In [32]:
df['department']=df['department'].str.lower().str.replace("research & development","research_development").str.replace("human resources", "human_resources")

df['department'].value_counts()

 research_development     196
 sales                     91
 human_resources           15
Name: department, dtype: int64

In [33]:
df['department']=df['department'].replace (np.nan, "desconocido")

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1614 entries, 0 to 1613
Data columns (total 41 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       1614 non-null   int64
 1   attrition                 1614 non-null   object
 2   business_travel           1614 non-null   object
 3   daily_rate                1490 non-null   float64
 4   department                1614 non-null   object
 5   distancefromhome          1614 non-null   int64
 6   education                 1614 non-null   int64
 7   educationfield            869 non-null    object
 8   employeecount             1614 non-null   int64
 9   employeenumber            1183 non-null   object
 10  environmentsatisfaction   1614 non-null   int64
 11  gender                    1614 non-null   int64
 12  hourlyrate                1614 non-null   object
 13  jobinvolvement            1614 non-null   int64
 14  joblevel                  1614 non-null   int64
 15  jobrole                   1614 non-null   object
 16  jobsatisfaction           1614 non-null   int64
 17  maritalstatus             963 non-null    object
 18  monthlyincome             771 non-null    object
 19  monthlyrate               1614 non-null   int64
 20  numcompaniesworked        1614 non-null   int64
 21  over18                    713 non-null    object
 22  overtime                  938 non-null    object
 23  percentsalaryhike         1614 non-null   int64
 24  performancerating         1419 non-null   object
 25  relationshipsatisfaction  1614 non-null   int64
 26  standardhours             419 non-null    object
 27  stockoptionlevel          1614 non-null   int64
 28  totalworkingyears         1088 non-null   object
 29  trainingtimeslastyear     1614 non-null   int64
 30  worklifebalance           1506 non-null   object
 31  yearsatcompany            1614 non-null   int64
 32  yearsincurrentrole        34 non-null     object
 33  yearssincelastpromotion   1614 non-null   int64
 34  yearswithcurrmanager      1614 non-null   int64
 35  sameasmonthlyincome       771 non-null    object
 36  datebirth                 1614 non-null   int64
 37  salary                    1614 non-null   object
 38  roledepartament           302 non-null    object
 39  numberchildren            0 non-null      float64
 40  remotework                1614 non-null   object
dtypes: float64(2), int64(19), object(20)
memory usage: 529.6+ KB

In [35]:
df.rename (columns={"distancefromhome": "distance_from_home", 
                    "educationfield": "education_field", 
                    "employeecount": "employee_count",
                    "employeenumber": "employee_number",
                    "environmentsatisfaction": "environment_satisfaction",
                    "hourlyrate": "hourly_rate", 
                    "jobinvolvement": "job_involvement",
                    "joblevel": "job_level",
                    "jobrole": "job_role",
                    "jobsatisfaction": "job_satisfaction",
                    "maritalstatus": "marital_status",
                    "monthlyincome": "monthly_income",
                    "monthlyrate": " monthly_rate",
                    "numcompaniesworked": "num_companies_worked",
                    "over18": "over_18",
                    "percentsalaryhike": "percent_salary_hike",
                    "performancerating": "performance_rating",
                    "relationshipsatisfaction": "relationship_satisfaction",
                    "standardhours": "standard_hours",
                    "stockoptionlevel": "stock_option_level",
                    "totalworkingyears": "total_working_years",
                    "trainingtimeslastyear": "training_times_last_year",
                    "worklifebalance": "work_life_balance",
                    "yearsatcompany": "years_at_company",
                    "yearsincurrentrole": "years_in_current_role",
                    "yearssincelastpromotion": "years_since_last_promotion",
                    "yearswithcurrmanager": "years_with_curr_manager",
                    "sameasmonthlyincome": "same_as_monthly_income",
                    "datebirth": "date_birth",
                    "roledepartament": "role_departament",
                    "numberchildren": "number_children",
                    "remotework": "remote_work"}, inplace= True)

In [36]:
df["distance_from_home"].value_counts()
pd.set_option('display.max_rows', 70)

In [37]:
df["distance_from_home"].value_counts()

 2     217
 1     203
 10     86
 9      85
 8      81
 7      80
 3      79
 5      62
 6      61
 4      61
 16     30
 11     28
 15     27
 23     26
 29     25
 25     24
 24     24
 18     22
 26     22
 14     21
 12     21
 21     19
 17     19
 13     19
 20     18
 28     17
 22     16
 19     16
 27     13
-13     11
-12     11
-24     11
-18      8
-47      7
-35      7
-38      7
-19      6
-36      6
-14      6
-31      6
-26      6
-25      6
-42      6
-22      5
-45      5
-48      5
-10      5
-46      5
-16      5
-27      4
-30      4
-20      4
-29      4
-41      4
-32      4
-37      4
-17      3
-11      3
-15      3
-23      3
-33      3
-44      3
-21      2
-49      2
-28      2
-34      2
-43      2
-39      1
-40      1
Name: distance_from_home, dtype: int64

In [38]:
def positive(numero):
    if numero <0:
        return -numero
    else:
        return numero

In [39]:
df["distance_from_home"]= df["distance_from_home"].apply(positive)

In [40]:
df.head()

,age,attrition,business_travel,daily_rate,department,distance_from_home,education,education_field,employee_count,employee_number,environment_satisfaction,gender,hourly_rate,job_involvement,job_level,job_role,job_satisfaction,marital_status,monthly_income,monthly_rate,num_companies_worked,over_18,overtime,percent_salary_hike,performance_rating,relationship_satisfaction,standard_hours,stock_option_level,total_working_years,training_times_last_year,work_life_balance,years_at_company,years_in_current_role,years_since_last_promotion,years_with_curr_manager,same_as_monthly_income,date_birth,salary,role_departament,number_children,remote_work
0,51,No,desconocido,684.0,desconocido,6,3,NaN,1,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,desconocido,699.0,desconocido,1,4,Life Sciences,1,"259,0",3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,42,No,travel_rarely,532.0,research_development,4,2,Technical Degree,1,"319,0",3,0,58,3,5,ManaGER,4,Married,"19232,0",4933,1,NaN,No,11,"3,0",4,NaN,0,"22,0",3,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,359.0,desconocido,2,4,Medical,1,NaN,1,1,82,3,4,ReseArCH DIrECtOr,3,Married,"17169,0",26703,3,Y,NaN,19,"3,0",2,NaN,2,NaN,2,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,46,No,desconocido,1319.0,desconocido,3,3,Technical Degree,1,NaN,1,1,45,4,4,sAleS EXECUtIve,1,Divorced,NaN,7739,2,Y,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0

In [41]:
df["distance_from_home"].describe()

count    1614.000000
mean       11.141884
std        10.450560
min         1.000000
25%         2.000000
50%         8.000000
75%        17.000000
max        49.000000
Name: distance_from_home, dtype: float64

In [42]:
df[["education", "education_field" ]]
pd.set_option('display.max_rows', 100)

In [43]:
df[["education", "education_field" ]]

      education   education_field
0             3               NaN
1             4     Life Sciences
2             2  Technical Degree
3             4           Medical
4             3  Technical Degree
...         ...               ...
1609          1     Life Sciences
1610          2               NaN
1611          5               NaN
1612          4  Technical Degree
1613          2           Medical

[1614 rows x 2 columns]

In [44]:
df["education"].describe()

count    1614.000000
mean        2.925031
std         1.022357
min         1.000000
25%         2.000000
50%         3.000000
75%         4.000000
max         5.000000
Name: education, dtype: float64

In [45]:
df["education"].value_counts()

3    621
4    445
2    314
1    180
5     54
Name: education, dtype: int64

In [46]:
df["education_field"].value_counts()

Life Sciences       349
Medical             276
Marketing           104
Technical Degree     69
Other                59
Human Resources      12
Name: education_field, dtype: int64

In [47]:
df["education_field"]=df["education_field"].replace(np.nan, "desconocido")

df["education_field"]

0            desconocido
1          Life Sciences
2       Technical Degree
3                Medical
4       Technical Degree
              ...
1609       Life Sciences
1610         desconocido
1611         desconocido
1612    Technical Degree
1613             Medical
Name: education_field, Length: 1614, dtype: object

In [48]:
df["education_field"]=df["education_field"].str.lower().str.replace("research & development","research_development").str.replace("human resources", "human_resources")

df["education_field"].value_counts()

desconocido         745
life sciences       349
medical             276
marketing           104
technical degree     69
other                59
human_resources      12
Name: education_field, dtype: int64

In [49]:
dict_education= {"Life Sciences":"life_sciences",
                 "Medical"  :"medical",
                 "Marketing": "marketing",
                 "Technical Degree" : "technical_degree",
                 "Other": "other",
                 "Human Resources": "human_resources",
                 "desconocido": "desconocido"}

In [50]:
df["education_field"]=df["education_field"].map (dict_education)
df["education_field"]

0       desconocido
1               NaN
2               NaN
3               NaN
4               NaN
           ...
1609            NaN
1610    desconocido
1611    desconocido
1612            NaN
1613            NaN
Name: education_field, Length: 1614, dtype: object

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1614 entries, 0 to 1613
Data columns (total 41 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   age                         1614 non-null   int64
 1   attrition                   1614 non-null   object
 2   business_travel             1614 non-null   object
 3   daily_rate                  1490 non-null   float64
 4   department                  1614 non-null   object
 5   distance_from_home          1614 non-null   int64
 6   education                   1614 non-null   int64
 7   education_field             745 non-null    object
 8   employee_count              1614 non-null   int64
 9   employee_number             1183 non-null   object
 10  environment_satisfaction    1614 non-null   int64
 11  gender                      1614 non-null   int64
 12  hourly_rate                 1614 non-null   object
 13  job_involvement             1614 non-null   int64
 14  job_level                   1614 non-null   int64
 15  job_role                    1614 non-null   object
 16  job_satisfaction            1614 non-null   int64
 17  marital_status              963 non-null    object
 18  monthly_income              771 non-null    object
 19   monthly_rate               1614 non-null   int64
 20  num_companies_worked        1614 non-null   int64
 21  over_18                     713 non-null    object
 22  overtime                    938 non-null    object
 23  percent_salary_hike         1614 non-null   int64
 24  performance_rating          1419 non-null   object
 25  relationship_satisfaction   1614 non-null   int64
 26  standard_hours              419 non-null    object
 27  stock_option_level          1614 non-null   int64
 28  total_working_years         1088 non-null   object
 29  training_times_last_year    1614 non-null   int64
 30  work_life_balance           1506 non-null   object
 31  years_at_company            1614 non-null   int64
 32  years_in_current_role       34 non-null     object
 33  years_since_last_promotion  1614 non-null   int64
 34  years_with_curr_manager     1614 non-null   int64
 35  same_as_monthly_income      771 non-null    object
 36  date_birth                  1614 non-null   int64
 37  salary                      1614 non-null   object
 38  role_departament            302 non-null    object
 39  number_children             0 non-null      float64
 40  remote_work                 1614 non-null   object
dtypes: float64(2), int64(19), object(20)
memory usage: 529.6+ KB

In [52]:
df.drop("employee_count", axis=1, inplace= True)

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1614 entries, 0 to 1613
Data columns (total 40 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   age                         1614 non-null   int64
 1   attrition                   1614 non-null   object
 2   business_travel             1614 non-null   object
 3   daily_rate                  1490 non-null   float64
 4   department                  1614 non-null   object
 5   distance_from_home          1614 non-null   int64
 6   education                   1614 non-null   int64
 7   education_field             745 non-null    object
 8   employee_number             1183 non-null   object
 9   environment_satisfaction    1614 non-null   int64
 10  gender                      1614 non-null   int64
 11  hourly_rate                 1614 non-null   object
 12  job_involvement             1614 non-null   int64
 13  job_level                   1614 non-null   int64
 14  job_role                    1614 non-null   object
 15  job_satisfaction            1614 non-null   int64
 16  marital_status              963 non-null    object
 17  monthly_income              771 non-null    object
 18   monthly_rate               1614 non-null   int64
 19  num_companies_worked        1614 non-null   int64
 20  over_18                     713 non-null    object
 21  overtime                    938 non-null    object
 22  percent_salary_hike         1614 non-null   int64
 23  performance_rating          1419 non-null   object
 24  relationship_satisfaction   1614 non-null   int64
 25  standard_hours              419 non-null    object
 26  stock_option_level          1614 non-null   int64
 27  total_working_years         1088 non-null   object
 28  training_times_last_year    1614 non-null   int64
 29  work_life_balance           1506 non-null   object
 30  years_at_company            1614 non-null   int64
 31  years_in_current_role       34 non-null     object
 32  years_since_last_promotion  1614 non-null   int64
 33  years_with_curr_manager     1614 non-null   int64
 34  same_as_monthly_income      771 non-null    object
 35  date_birth                  1614 non-null   int64
 36  salary                      1614 non-null   object
 37  role_departament            302 non-null    object
 38  number_children             0 non-null      float64
 39  remote_work                 1614 non-null   object
dtypes: float64(2), int64(18), object(20)
memory usage: 517.0+ KB

In [54]:

#pd.set_option('display.max_rows', None)
df["employee_number"].value_counts()

482,0     2
530,0     2
507,0     2
517,0     2
522,0     2
         ..
161,0     1
164,0     1
190,0     1
194,0     1
2040,0    1
Name: employee_number, Length: 1079, dtype: int64

In [55]:
df["employee_number"].value_counts()
df[["attrition","employee_number"]].sort_values(by="employee_number")

     attrition employee_number
1227        No            10,0
33          No           100,0
977         No          1001,0
215         No          1002,0
1351        No          1003,0
...        ...             ...
1601        No             NaN
1602       Yes             NaN
1607        No             NaN
1611        No             NaN
1613        No             NaN

[1614 rows x 2 columns]

In [56]:
df["employee_number"]==424

0       False
1       False
2       False
3       False
4       False
        ...
1609    False
1610    False
1611    False
1612    False
1613    False
Name: employee_number, Length: 1614, dtype: bool

In [57]:
df[df["employee_number"]=="424,0"]

,age,attrition,business_travel,daily_rate,department,distance_from_home,education,education_field,employee_number,environment_satisfaction,gender,hourly_rate,job_involvement,job_level,job_role,job_satisfaction,marital_status,monthly_income,monthly_rate,num_companies_worked,over_18,overtime,percent_salary_hike,performance_rating,relationship_satisfaction,standard_hours,stock_option_level,total_working_years,training_times_last_year,work_life_balance,years_at_company,years_in_current_role,years_since_last_promotion,years_with_curr_manager,same_as_monthly_income,date_birth,salary,role_departament,number_children,remote_work
872,31,No,travel_rarely,106.0,desconocido,2,3,NaN,"424,0",1,0,62,2,2,hUmAN rESOuRCEs,1,NaN,"6410,0",17822,3,Y,No,12,"3,0",4,NaN,0,NaN,1,"3,0",2,NaN,1,0,"6410,0",1992,1000000000$,NaN,NaN,False
1513,31,No,travel_rarely,106.0,desconocido,2,3,NaN,"424,0",1,0,62,2,2,hUMan rEsOuRCES,1,NaN,"6410,0",17822,3,Y,No,12,"3,0",4,NaN,0,NaN,1,"3,0",2,NaN,1,0,"6410,0",1992,1000000000$,NaN,NaN,True

In [58]:
df.duplicated().index #filas que tienen duplicados

Int64Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
            ...
            1604, 1605, 1606, 1607, 1608, 1609, 1610, 1611, 1612, 1613],
           dtype='int64', length=1614)

In [59]:
df["environment_satisfaction"].value_counts()

4     460
3     459
1     298
2     297
12      7
35      6
13      6
14      5
24      5
47      5
36      4
48      4
41      4
46      4
42      4
45      3
11      3
22      3
17      3
18      3
20      3
25      3
27      3
37      2
29      2
19      2
38      2
31      2
15      2
16      2
26      1
39      1
10      1
49      1
21      1
28      1
33      1
43      1
Name: environment_satisfaction, dtype: int64

In [60]:
def primer_digito(numero):
    digitos = [int(d) for d in str(numero)]
    return digitos[0]

In [61]:
df["environment_satisfaction"]=df["environment_satisfaction"].apply(primer_digito)

In [62]:
df["environment_satisfaction"].value_counts()

4    486
3    477
1    332
2    319
Name: environment_satisfaction, dtype: int64

In [63]:
for columna in df.columns[10:]:
    print(columna)
    display (df[columna].value_counts())
    print("------------------------------")

gender

0    971
1    643
Name: gender, dtype: int64

------------------------------
hourly_rate

Not Available    84
42               33
66               32
48               30
57               29
84               29
54               28
46               28
98               28
87               27
72               27
96               27
92               27
32               26
56               26
79               26
86               25
81               25
52               25
61               25
62               24
83               24
51               24
82               24
43               23
74               23
88               23
45               23
41               23
77               23
73               23
94               23
60               22
78               22
95               22
99               21
76               21
80               21
59               21
67               21
91               20
97               20
75               20
90               20
85               20
44               20
49               20
64               19
55               19
65               19
71               19
100              19
39               19
37               19
36               18
40               18
58               18
35               17
93               17
70               17
33               17
89               17
30               17
63               16
31               16
69               16
50               15
47               15
53               13
68               13
38               12
34               11
Name: hourly_rate, dtype: int64

------------------------------
job_involvement

3    955
2    406
4    164
1     89
Name: job_involvement, dtype: int64

------------------------------
job_level

2    597
1    586
3    242
4    113
5     76
Name: job_level, dtype: int64

------------------------------
job_role

 mANager                       4
 ManageR                       3
 ManagEr                       3
 mAnaGeR                       3
 MANAgER                       3
                              ..
 ResEArch ScieNTiST            1
 HealthcARE RePreSENtAtiVe     1
 ReSearcH scIEntist            1
 LAbOrATOry techNicIan         1
 mAnUfactURInG DiRECTOr        1
Name: job_role, Length: 1579, dtype: int64

------------------------------
job_satisfaction

4    514
3    481
1    317
2    302
Name: job_satisfaction, dtype: int64

------------------------------
marital_status

Married     404
Single      325
Divorced    188
Marreid      35
divorced     11
Name: marital_status, dtype: int64

------------------------------
monthly_income

6347,0     4
5304,0     4
2657,0     3
2258,0     3
5405,0     2
          ..
3102,0     1
4556,0     1
4230,0     1
4859,0     1
19431,0    1
Name: monthly_income, Length: 668, dtype: int64

------------------------------
 monthly_rate

9150     4
11737    3
17001    3
6069     3
21981    3
        ..
25470    1
10205    1
9973     1
17089    1
16642    1
Name:  monthly_rate, Length: 1427, dtype: int64

------------------------------
num_companies_worked

1    573
0    226
3    169
4    157
2    156
7     84
6     73
5     66
9     59
8     51
Name: num_companies_worked, dtype: int64

------------------------------
over_18

Y    713
Name: over_18, dtype: int64

------------------------------
overtime

No     682
Yes    256
Name: overtime, dtype: int64

------------------------------
percent_salary_hike

11    232
13    230
12    225
14    220
15    110
18     98
17     88
16     86
19     82
20     60
22     59
21     51
23     29
24     25
25     19
Name: percent_salary_hike, dtype: int64

------------------------------
performance_rating

3,0    1205
4,0     214
Name: performance_rating, dtype: int64

------------------------------
relationship_satisfaction

3    504
4    468
2    339
1    303
Name: relationship_satisfaction, dtype: int64

------------------------------
standard_hours

80,0    419
Name: standard_hours, dtype: int64

------------------------------
stock_option_level

0    687
1    666
2    172
3     89
Name: stock_option_level, dtype: int64

------------------------------
total_working_years

10,0    144
8,0      86
6,0      84
9,0      69
5,0      66
7,0      56
4,0      54
1,0      53
12,0     34
3,0      32
14,0     30
13,0     30
11,0     29
15,0     28
16,0     28
20,0     28
18,0     27
21,0     23
17,0     22
2,0      21
22,0     18
19,0     17
24,0     14
23,0     13
28,0     13
26,0      8
0,0       8
29,0      6
36,0      6
25,0      6
33,0      6
37,0      5
27,0      5
31,0      4
30,0      3
32,0      3
35,0      3
40,0      3
34,0      2
38,0      1
Name: total_working_years, dtype: int64

------------------------------
training_times_last_year

2    598
3    534
4    137
5    136
1     77
6     72
0     60
Name: training_times_last_year, dtype: int64

------------------------------
work_life_balance

3,0    913
2,0    359
4,0    155
1,0     79
Name: work_life_balance, dtype: int64

------------------------------
years_at_company

5     208
1     171
3     141
2     141
10    133
7     115
4     114
8     106
9      94
6      78
0      44
11     36
20     29
13     26
15     21
14     19
22     17
12     15
18     15
16     14
21     14
19     12
17      9
24      7
25      5
33      5
26      4
32      3
27      3
31      3
36      3
29      2
23      2
40      2
34      1
37      1
30      1
Name: years_at_company, dtype: int64

------------------------------
years_in_current_role

2,0     11
7,0      5
0,0      4
4,0      3
1,0      3
11,0     2
6,0      2
3,0      2
13,0     1
12,0     1
Name: years_in_current_role, dtype: int64

------------------------------
years_since_last_promotion

0     625
1     384
2     177
7      93
4      67
3      62
5      53
6      37
11     26
8      20
9      18
15     15
12     11
13     10
14     10
10      6
Name: years_since_last_promotion, dtype: int64

------------------------------
years_with_curr_manager

2     380
0     270
7     267
3     148
8     115
4     104
1      84
9      70
5      36
10     31
6      30
11     22
12     20
13     16
17      8
15      5
14      5
16      3
Name: years_with_curr_manager, dtype: int64

------------------------------
same_as_monthly_income

6347,0     4
5304,0     4
2657,0     3
2258,0     3
5405,0     2
          ..
3102,0     1
4556,0     1
4230,0     1
4859,0     1
19431,0    1
Name: same_as_monthly_income, Length: 668, dtype: int64

------------------------------
date_birth

1988    84
1992    83
1989    83
1994    78
1987    75
1991    65
1985    64
1993    64
1990    61
1983    60
1986    55
1996    54
1995    53
1981    50
1978    48
1982    46
1997    46
1984    45
1980    40
1977    38
1979    34
1973    31
1999    27
1976    27
1998    27
1968    25
1974    25
1969    20
1972    20
1970    20
1975    20
1971    19
1967    17
2001    16
2002    16
1965    15
2000    15
2003    11
1964    10
2004     9
2005     8
1963     5
1966     5
Name: date_birth, dtype: int64

------------------------------
salary

1000000000$    1614
Name: salary, dtype: int64

------------------------------
role_departament

 MaNAgeR  -  Sales                                        2
 ManaGER  -  Research & Development                       1
 ReseaRch scIENTisT  -  Research & Development            1
 ManufacTURInG DIRECtOR  -  Research & Development        1
 hEalthCaRe reprEseNTaTiVe  -  Research & Development     1
                                                         ..
 saLES eXEcUTiVE  -  Sales                                1
 mANUfacTURiNG dIRectOR  -  Research & Development        1
 huMAn ResOurces  -  Human Resources                      1
 HUMAN ResoURCeS  -  Human Resources                      1
 sAleS EXECUtIvE  -  Sales                                1
Name: role_departament, Length: 301, dtype: int64

------------------------------
number_children

Series([], Name: number_children, dtype: int64)

------------------------------
remote_work

1        360
True     345
0        309
False    305
Yes      295
Name: remote_work, dtype: int64

------------------------------

In [64]:
mapa ={0:"male", 1:"female"}
df["gender"]=df["gender"].map(mapa)
df["gender"].unique()

array(['male', 'female'], dtype=object)

In [65]:
df["gender"].value_counts()

male      971
female    643
Name: gender, dtype: int64

In [66]:
df["hourly_rate"]= df["hourly_rate"].replace("Not Available", np.nan)

In [67]:
df["hourly_rate"].isnull().sum()

84

In [68]:
df["hourly_rate"]= df["hourly_rate"].apply(pd.to_numeric)

In [69]:
df["job_role"]=df["job_role"].str.lower()

In [70]:
df["job_role"].value_counts()

 sales executive               369
 research scientist            314
 laboratory technician         278
 manufacturing director        158
 healthcare representative     149
 manager                       111
 sales representative           90
 research director              88
 human resources                57
Name: job_role, dtype: int64

In [71]:
df["job_role"].str.replace(" ", "_")

0            _research_director_
1                      _manager_
2                      _manager_
3            _research_director_
4              _sales_executive_
                  ...
1609           _sales_executive_
1610     _laboratory_technician_
1611           _sales_executive_
1612           _sales_executive_
1613    _manufacturing_director_
Name: job_role, Length: 1614, dtype: object

In [72]:
df["job_role"]=df["job_role"].str.strip().str.replace(" ", "_")

In [73]:
df["job_role"].unique()

array(['research_director', 'manager', 'sales_executive',
       'manufacturing_director', 'research_scientist',
       'healthcare_representative', 'laboratory_technician',
       'sales_representative', 'human_resources'], dtype=object)

In [74]:
df["marital_status"] =df["marital_status"].str.lower().str.replace("marreid", "married")

In [75]:
df["marital_status"].value_counts()

married     439
single      325
divorced    199
Name: marital_status, dtype: int64

In [76]:
df["monthly_income"].sample(10)

1071     6392,0
257         NaN
827     10650,0
1220        NaN
1262     6553,0
290         NaN
987         NaN
562         NaN
1320     2642,0
68          NaN
Name: monthly_income, dtype: object

In [77]:
df.drop("same_as_monthly_income", axis=1, inplace=True)

In [78]:
df["monthly_income"] = df["monthly_income"].str.replace(",",".")
df["monthly_income"]

0       19537.0
1       19999.0
2       19232.0
3       17169.0
4           NaN
         ...
1609    10325.0
1610     4447.0
1611        NaN
1612        NaN
1613    10845.0
Name: monthly_income, Length: 1614, dtype: object

In [79]:
df["monthly_income"] = df["monthly_income"].apply(pd.to_numeric)

In [80]:
df.rename(columns={" monthly_rate": "monthly_rate"}, inplace=True)

In [81]:
df[["monthly_rate", "monthly_income"]].sample(10)

      monthly_rate  monthly_income
362          11737          2329.0
1420         11591             NaN
299          10268             NaN
881           6069             NaN
1426          3811          2862.0
1443         21495          2956.0
1568         16177          4805.0
7            24532             NaN
112          11012          3072.0
885           7551          2657.0

In [82]:
df.drop(["over_18", "number_children"], axis=1, inplace=True)

In [83]:
df["overtime"]=df["overtime"].replace(np.nan, "desconocido")

In [84]:
df.columns

Index(['age', 'attrition', 'business_travel', 'daily_rate', 'department',
       'distance_from_home', 'education', 'education_field', 'employee_number',
       'environment_satisfaction', 'gender', 'hourly_rate', 'job_involvement',
       'job_level', 'job_role', 'job_satisfaction', 'marital_status',
       'monthly_income', 'monthly_rate', 'num_companies_worked', 'overtime',
       'percent_salary_hike', 'performance_rating',
       'relationship_satisfaction', 'standard_hours', 'stock_option_level',
       'total_working_years', 'training_times_last_year', 'work_life_balance',
       'years_at_company', 'years_in_current_role',
       'years_since_last_promotion', 'years_with_curr_manager', 'date_birth',
       'salary', 'role_departament', 'remote_work'],
      dtype='object')

In [85]:
df["performance_rating"]=df["performance_rating"].replace(np.nan, "3,0").str.replace(",", ".").apply(pd.to_numeric)

In [86]:
df.drop("standard_hours", axis=1, inplace=True)

In [87]:
df["stock_option_level"].describe()

count    1614.000000
mean        0.791202
std         0.842396
min         0.000000
25%         0.000000
50%         1.000000
75%         1.000000
max         3.000000
Name: stock_option_level, dtype: float64

In [88]:
df["total_working_years"]=df["total_working_years"].str.replace(",", ".").apply(pd.to_numeric)

In [89]:
df["work_life_balance"]=df["work_life_balance"].replace(np.nan, "3,0").str.replace(",", ".").apply(pd.to_numeric)

In [90]:
df.drop("years_in_current_role", axis=1, inplace=True)

In [91]:
df["date_birth"]=pd.to_datetime(df["date_birth"], format='%Y')

In [92]:
df["date_birth"]=df["date_birth"].dt.year

In [93]:
df["date_birth"].dtypes

dtype('int64')

In [94]:
df.drop("salary", axis=1, inplace=True)

In [95]:
df["role_departament"]=df["role_departament"].str.lower()

In [96]:
df[["role_departament", "job_role", "department"]].sample(10)

,role_departament,job_role,department
1209,NaN,research_scientist,desconocido
736,NaN,sales_executive,desconocido
1085,NaN,research_scientist,desconocido
1222,research scientist - research & development,research_scientist,research_development
183,NaN,sales_executive,desconocido
664,NaN,sales_executive,desconocido
1313,sales executive - sales,sales_executive,sales
764,research scientist - research & development,research_scientist,research_development
1186,NaN,healthcare_representative,desconocido
867,NaN,laboratory_technician,desconocido

In [97]:
df.drop("role_departament", axis=1, inplace=True)

In [98]:
df["remote_work"]=df["remote_work"].map({"1": "yes", "0":"no", "True":"yes", "False":"no", "Yes":"yes"})

In [100]:
df["remote_work"].unique()

array(['yes', 'no'], dtype=object)